In [1]:
import pandas as pd
import pyspark
from pyspark.sql import SparkSession
## You can not read hole directory using pandas but in pyspark you can

In [2]:
ss = SparkSession.builder.appName("Analysis Using panda").getOrCreate()

24/10/19 22:02:07 WARN Utils: Your hostname, dhrumil-Inspiron-14-7440-2-in-1 resolves to a loopback address: 127.0.1.1, but we couldn't find any external IP address!
24/10/19 22:02:07 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
24/10/19 22:02:07 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
24/10/19 22:02:08 WARN MacAddressUtil: Failed to find a usable hardware address from the network interfaces; using random bytes: 31:02:12:74:60:4f:50:20
24/10/19 22:02:08 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.

In [5]:
df_spark = ss.read.csv("StockData")

In [7]:
df = df_spark.toPandas()

In [8]:
df.columns = df.iloc[0]
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15120 entries, 0 to 15119
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Ticker      15120 non-null  object
 1   Date        15120 non-null  object
 2   Close/Last  15120 non-null  object
 3   Volume      15120 non-null  object
 4   Open        15120 non-null  object
 5   High        15120 non-null  object
 6   Low         15120 non-null  object
dtypes: object(7)
memory usage: 827.0+ KB

In [9]:
df["Ticker"].head()

0    Ticker
1     BRK-B
2     BRK-B
3     BRK-B
4     BRK-B
Name: Ticker, dtype: object

In [10]:
df[["Ticker", "Date", "Close/Last"]].tail()

0     Ticker        Date Close/Last
15115    QQQ  06/06/2018     175.86
15116    QQQ  06/05/2018     174.84
15117    QQQ  06/04/2018      174.3
15118    QQQ  06/01/2018     172.74
15119    QQQ  05/31/2018     170.07

In [11]:
df.isin(["Ticker", "Date", "Close/Last"])

0      Ticker   Date  Close/Last  Volume   Open   High    Low
0        True   True        True   False  False  False  False
1       False  False       False   False  False  False  False
2       False  False       False   False  False  False  False
3       False  False       False   False  False  False  False
4       False  False       False   False  False  False  False
...       ...    ...         ...     ...    ...    ...    ...
15115   False  False       False   False  False  False  False
15116   False  False       False   False  False  False  False
15117   False  False       False   False  False  False  False
15118   False  False       False   False  False  False  False
15119   False  False       False   False  False  False  False

[15120 rows x 7 columns]

In [13]:
df[((df["Ticker"] == "MSFT") | (df["Ticker"] == "V")) & (df["Date"] == "05/31/2023")].head()

0     Ticker        Date Close/Last    Volume      Open      High       Low
1261    MSFT  05/31/2023   $328.39   45950550  $332.29   $335.94   $327.33
10081      V  05/31/2023   $221.03   20460620  $219.96   $221.53   $216.14

<bound method DataFrame.info of 0      Ticker        Date  Close/Last    Volume      Open      High       Low
0      Ticker        Date  Close/Last    Volume      Open      High       Low
1       BRK-B  05/31/2023    $321.08    6175417  $321.12   $322.41   $319.39
2       BRK-B  05/30/2023    $322.19    3232461  $321.86   $322.47   $319.00
3       BRK-B  05/26/2023    $320.60    3229873  $320.44   $322.63   $319.67
4       BRK-B  05/25/2023    $319.02    4251935  $320.56   $320.56   $317.71
...       ...         ...         ...       ...       ...       ...       ...
15115     QQQ  06/06/2018      175.86  24972980   175.025    175.89    174.14
15116     QQQ  06/05/2018      174.84  24739120    174.69    175.13   174.065
15117     QQQ  06/04/2018       174.3  19984280    173.16    174.34    173.07
15118     QQQ  06/01/2018      172.74  45446770    170.88    172.84    170.87
15119     QQQ  05/31/2018      170.07  35517240    170.13     171.2    169.63

[15120 rows x 7 columns]>